artillery/search-and-add-to-cart.yml
config:
  target: 'http://localhost:3000/api'
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 30
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    # - duration: 600
    #   arrivalRate: 50
    #   name: Sustained load
  payload:
    path: 'keywords.csv'
    fields:
      - 'keyword'

scenarios:
  - name: 'Search and buy'
    flow:
      - post:
          url: '/search'
          json:
            keyword: '{{ keyword }}'
          capture:
            - json: '$.results[0].id'
              as: 'productId'
      - get:
          url: '/product/{{ productId }}/details'
      - think: 5
      - post:
          url: '/cart'
          json:
            productId: '{{ productId }}'